app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "NEW SCHHOL"], ["room_number", 123]]

    def update
        @school_class.update(params.require(:school_class).permit(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "NEW SC"], ["room_number", 123234], ["id", 2]]