app/controllers/students_controller.rb

    def update
        @student.update(params.require(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgenswkejfkjwef"], ["updated_at", "2021-02-17 10:09:24.808592"], ["id", 1]]